tutorials/rigidBodyAndBeam/rigidBodyAndBeam_short/0/beam/DTheta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "2";
    object      DTheta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<vector> 
60
(
(3.61456e-19 8.52668e-11 -1.55028e-23)
(3.59611e-19 8.50341e-11 -1.45994e-23)
(3.57832e-19 8.45691e-11 -1.41988e-23)
(3.5612e-19 8.38733e-11 -1.35104e-23)
(3.54474e-19 8.29485e-11 -1.30055e-23)
(3.52895e-19 8.17972e-11 -1.24024e-23)
(3.51381e-19 8.04225e-11 -1.18688e-23)
(3.49932e-19 7.8828e-11 -1.1304e-23)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (3.61456e-19 8.52668e-11 -1.55028e-23);
    }
    right
    {
        type            calculated;
        value           uniform (3.61836e-19 -8.55159e-11 1.55217e-23);
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
