tutorials/rigidBodyAndBeam/rigidBodyAndBeam_short/0/beam/WIncrement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "2";
    object      WIncrement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
60
(
(2.8625e-06 6.42811e-26 9.46774e-10)
(8.5875e-06 1.84079e-26 2.79466e-09)
(1.43125e-05 1.20704e-26 4.57039e-09)
(2.00375e-05 1.70688e-26 6.28655e-09)
(2.57625e-05 -7.0964e-27 7.93756e-09)
(3.14875e-05 8.52305e-27 9.52559e-09)
(3.72125e-05 -1.46669e-26 1.105e-08)
(4.29375e-05 6.03774e-27 1.25109e-08)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    right
    {
        type            calculated;
        value           uniform (0.0003435 0 0);
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
