tutorials/rigidBodyAndBeam/rigidBodyAndBeam_short/0/beam/pointW
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       pointVectorField;
    location    "2";
    object      pointW;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
1952
(
(2.37785 2.375 0.85)
(2.37785 2.375 0.85)
(2.37785 2.375 0.85)
(2.37785 2.375 0.85)
(2.37785 2.375 0.85)
(2.37785 2.375 0.85)
(2.37785 2.375 0.85)
(2.37785 2.375 0.85)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
    }
    right
    {
        type            calculated;
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
